- tab: "groepeer_op_verschil"
  testcases:
    - expression: "groepeer_op_verschil([2, 4, 6, 9, 12, 15, 18])"
      return: [[2, 4, 6], [9, 12, 15, 18]]
    - expression: "groepeer_op_verschil([1, 3, 5, 8, 11, 14])"
      return: [[1, 3, 5], [8, 11, 14]]
    - expression: "groepeer_op_verschil([10, 20, 30, 40, 50])"
      return: [[10, 20, 30, 40, 50]]
    - expression: "groepeer_op_verschil([1, 2, 4, 7, 10, 13])"
      return: [[1, 2], [4, 7, 10, 13]]
    - expression: "groepeer_op_verschil([1, 2, 3, 4, 5])"
      return: [[1, 2, 3, 4, 5]]
    - expression: "groepeer_op_verschil([])"
      return: []
    - expression: "groepeer_op_verschil([1])"
      return: []
    - expression: "groepeer_op_verschil([1, 3])"
      return: [[1, 3]]
    - expression: "groepeer_op_verschil([1, 2, 4, 6, 8])"
      return: [[1, 2], [4, 6, 8]]
    - expression: "groepeer_op_verschil([5, 10, 15, 22, 29, 36])"
      return: [[5, 10, 15], [22, 29, 36]]
