- tab: "voeg_in_midden"
  testcases:
    - expression: "voeg_in_midden([1, 2, 3, 4], 99)"
      return: [1, 2, 99, 3, 4]
    - expression: "voeg_in_midden([10, 20, 30], 5)"
      return: [10, 5, 20, 30]
    - expression: "voeg_in_midden([], 42)"
      return: [42]
    - expression: "voeg_in_midden([7], 8)"
      return: [8, 7]
    - expression: "voeg_in_midden([1, 2], 3)"
      return: [1, 3, 2]
    - expression: "voeg_in_midden([1, 2, 3, 4, 5, 6], 0)"
      return: [1, 2, 3, 0, 4, 5, 6]
    - expression: "voeg_in_midden([100, 200, 300, 400, 500], 250)"
      return: [100, 250, 200, 300, 400, 500]
    - expression: "voeg_in_midden(['a', 'b', 'c', 'd'], 'x')"
      return: ["a", "b", "x", "c", "d"]
    - expression: "voeg_in_midden([True, False], None)"
      return: [True, None, False]
    - expression: "voeg_in_midden([1.1, 2.2, 3.3], 4.4)"
      return: [1.1, 4.4, 2.2, 3.3]
    - expression: "voeg_in_midden([1, 2, 3, 4, 5], 6)"
      return: [1, 6, 2, 3, 4, 5]
    - expression: "voeg_in_midden([0], 1)"
      return: [1, 0]
    - expression: "voeg_in_midden(['x', 'y', 'z'], 'w')"
      return: ["x", "w", "y", "z"]
    - expression: "voeg_in_midden([1, 2, 3, 4, 5, 6, 7, 8], 9)"
      return: [1, 2, 3, 4, 9, 5, 6, 7, 8]
